Documents/ТелеграмСообщенияВходящие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>ТелеграмСообщенияВходящие</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТелеграмСообщения</xr:Item>
				<xr:Item>AccumulationRegister.ТелеграмСообщенияГруппыСообщений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>update_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелеграмКонтакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмКонтакты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СодержаниеСообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИДРодителя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СодержаниеЗапросаОбратногоВызова</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИДРодителя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ТелеграмСообщенияВходящие/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Сообщение++
	КорневыеЭлементы = Объект.СодержаниеСообщения.НайтиСтроки(Новый Структура("ИДРодителя", 0));
	ЭлементыДерева = СодержаниеВВидеДерева.ПолучитьЭлементы();
	ЗаполнитьДеревоВДокументе(ЭлементыДерева, КорневыеЭлементы);
	//Сообщение--
	
	//Запрос обратного вызова++
	КорневыеЭлементы = Объект.СодержаниеЗапросаОбратногоВызова.НайтиСтроки(Новый Структура("ИДРодителя", 0));
	ЭлементыДерева = ЗапросОбратногоВызоваВВидеДерева.ПолучитьЭлементы();
	ЗаполнитьЗапросОбратногоВызоваВВидеДерева(ЭлементыДерева, КорневыеЭлементы);
	//Запрос обратного вызова--

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеревоВДокументе(ЭлементРодитель, Коллекция)
	
	Для Каждого ЭлементКоллекции Из Коллекция Цикл		
		нСтрока = ЭлементРодитель.Добавить();
		нСтрока.Ключ = ЭлементКоллекции.Ключ;
		нСтрока.Значение = ЭлементКоллекции.Значение;
		
		ДочернииОбъекты = Объект.СодержаниеСообщения.НайтиСтроки(Новый Структура("ИДРодителя", ЭлементКоллекции.ИДСтроки));
		ЗаполнитьДеревоВДокументе(нСтрока.ПолучитьЭлементы(), ДочернииОбъекты);		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗапросОбратногоВызоваВВидеДерева(ЭлементРодитель, Коллекция)
	
	Для Каждого ЭлементКоллекции Из Коллекция Цикл		
		нСтрока = ЭлементРодитель.Добавить();
		нСтрока.Ключ = ЭлементКоллекции.Ключ;
		нСтрока.Значение = ЭлементКоллекции.Значение;
		
		ДочернииОбъекты = Объект.СодержаниеЗапросаОбратногоВызова.НайтиСтроки(Новый Структура("ИДРодителя", ЭлементКоллекции.ИДСтроки));
		ЗаполнитьЗапросОбратногоВызоваВВидеДерева(нСтрока.ПолучитьЭлементы(), ДочернииОбъекты);		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отбор = СписокВложений.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сообщение");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;	
	Отбор.ПравоеЗначение = Объект.Ссылка;
	Отбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	Отбор.Использование = Истина;

КонецПроцедуры
